sample_app/app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])

INSERT INTO "users" ("updated_at", "name", "created_at", "encrypted_password", "email", "admin", "salt") VALUES ('2011-12-01 11:22:18.109724', 'New User', '2011-12-01 11:22:18.109724', '589452a9c87de6690d3a9f69da21e4d76acef7e871a22fbe1f3c2ecf753a0a27', 'user@example.com', 'f', '4d210de82f066720a3ce0a07d077daf001bf6c15f21c88990683f48267cee0ef')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
UPDATE "users" SET "updated_at" = '2011-12-01 11:22:18.739725', "name" = 'New Name', "encrypted_password" = 'a2cac417192be266fc08a47d2746de4b9e139644be121119a73c9468fedf1841', "email" = 'user@example.org', "salt" = 'a178eb791c678759edb868f92077db0990f13f8d9cc51017765ebc4730df9f40' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

DELETE FROM "users" WHERE "users"."id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def destroy
    User.find(params[:id]).destroy